# Lab (sql-python-conection)

## Challenge

In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1. Establish a connection between Python and the Sakila database.

2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [8]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

1. Establish a connection between Python and the Sakila database.

In [9]:
password = getpass()

········

In [12]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [13]:
data = pd.read_sql_query('SELECT * FROM sakila.rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

In [14]:
 def rental_month(engine,month,year):
        query="SELECT SUBSTRING(rental_date, 1, 4) AS year,SUBSTRING(rental_date, 6, 2) AS month FROM rental; "
        mont_year_df=pd.read_sql(query,engine)
        return mont_year_df

In [15]:
month_year_df=rental_month(engine,5,2005)
month_year_df

       year month
0      2005    05
1      2005    05
2      2005    05
3      2005    05
4      2005    05
...     ...   ...
16039  2006    02
16040  2006    02
16041  2006    02
16042  2006    02
16043  2006    02

[16044 rows x 2 columns]

3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

In [90]:
def rental_count_month(df,month,year):
    #it looks that if you put the "f" at the begining of the string you are telling the code that you may put variables inside 
    #the string using the {} to do so.
    
    column_name = f"rentals_{month:02}_{year}" #creating a column variable to store the month and year(02 stands for month format)
    query = f"""SELECT customer_id ,COUNT(rental_id) AS {column_name} 
    FROM rental 
    WHERE YEAR(rental_date) = {year} AND MONTH(rental_date) = {month} 
    GROUP BY customer_id
    """
    

    rental_count_df=pd.read_sql(query,engine)
    return rental_count_df

In [91]:
result_df=rental_count_month(month_year_df,5,2005)
result_df2=rental_count_month(month_year_df,6,2005) # creating a second one to test last function
result_df

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [122]:
def compare_rentals(df1 ,df2):
    col_name_df1=df1.columns[1] #taking the column of first df using his location rather than his name,because the name might change
    col_name_df2=df2.columns[1] #same here
    
    #combine the dataframes
    # could not make the pd.concat work so i looked for other options like join or merge.
    # source https://ioflood.com/blog/pandas-concat/#:~:text=dataframes%20are%20merged.-,Exploring%20Alternative%20Concatenation%20Methods,()%20and%20join()%20functions.
    combined_df = df1.merge(df2, left_index=True, right_index=True)
    combined_df.fillna(0, inplace=True) #in case one dataframe is bigger than the other one,replace the nan values with 0
    combined_df["difference"] = combined_df[col_name_df1] - combined_df[col_name_df2] #create difference column with the difference between the 2 columns
    
    return combined_df

In [123]:
compare_rentals(result_df,result_df2)

,customer_id_x,rentals_05_2005,customer_id_y,rentals_06_2005,difference
0,1,2,1,7,-5
1,2,1,2,1,0
2,3,2,3,4,-2
3,5,3,4,6,-3
4,6,3,5,5,-2
...,...,...,...,...,...
515,594,4,525,1,3
516,595,1,526,9,-8
517,596,6,527,4,2
518,597,2,528,2,0
519,599,1,529,3,-2